docs/perf/2026-08-27-f5/documents-alone.txt
profile: documents-alone
url: http://127.0.0.1:3161/api/q/documents
load average at start: 5.63
started: 2026-08-27T06:25:04-07:00

Summary:
  Success rate:	100.00%
  Total:	30004.1820 ms
  Slowest:	7.2679 ms
  Fastest:	1.8103 ms
  Average:	2.2401 ms
  Requests/sec:	445.9378

  Total data:	779.82 MiB
  Size/request:	59.69 KiB
  Size/sec:	25.99 MiB

Response time histogram:
  1.810 ms [1]     |
  2.356 ms [11276] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.902 ms [1340]  |■■■
  3.448 ms [513]   |■
  3.993 ms [168]   |
  4.539 ms [68]    |
  5.085 ms [9]     |
  5.631 ms [2]     |
  6.176 ms [1]     |
  6.722 ms [0]     |
  7.268 ms [1]     |

Response time distribution:
  10.00% in 1.9729 ms
  25.00% in 2.0860 ms
  50.00% in 2.1535 ms
  75.00% in 2.2451 ms
  90.00% in 2.5950 ms
  95.00% in 2.9709 ms
  99.00% in 3.8125 ms
  99.90% in 4.5301 ms
  99.99% in 5.8198 ms


Details (average, fastest, slowest):
  DNS+dialup:	0.7898 ms, 0.7898 ms, 0.7898 ms
  DNS-lookup:	0.0868 ms, 0.0868 ms, 0.0868 ms

Status code distribution:
  [200] 13379 responses

Error distribution:
  [1] aborted due to deadline